2018/python-import.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-05 周六 16:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 导入相关</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb_24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 导入相关</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org713a00d">1. 简介</a></li>
<li><a href="#orgaee51d1">2. import 语法</a></li>
<li><a href="#org8f1a67b">3. 相对导入和绝对导入</a>
<ul>
<li><a href="#orgf28021b">3.1. 相对导入</a></li>
<li><a href="#org07539da">3.2. 绝对导入</a></li>
</ul>
</li>
<li><a href="#org9bda75a">4. 同名的包和模块</a></li>
<li><a href="#org4b75174">5. 执行一次导入后</a></li>
<li><a href="#org6d0bd17">6. 其他使用细节</a></li>
<li><a href="#org0ca95e1">7. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org713a00d" class="outline-2">
<h2 id="org713a00d"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Python</code> 导入相关的问题说简单也简单， 说坑也坑。
</p>

<p>
如果平时使用的时候避开容易出现坑的地方， 那么 <code>import</code> 就会老老实实的， 没有任何
问题。
</p>

<p>
但是， 常在河边走， 哪有不湿鞋。
</p>

<p>
为了尽可能的弄清楚这些坑， 决定来总结一下。
</p>
</div>
</div>

<div id="outline-container-orgaee51d1" class="outline-2">
<h2 id="orgaee51d1"><span class="section-number-2">2</span> import 语法</h2>
<div class="outline-text-2" id="text-2">
<p>
使用 <code>import</code> 导入的东西只有三种： <b>包</b>, <b>模块</b>, <b>其他对象</b>.
</p>

<ul class="org-ul">
<li><b>包</b>: <code>__init__.py</code> 文件所在目录</li>
<li><b>模块</b>: 单个 <code>.py</code> 文件</li>
<li><b>其他对象</b>: 除了 <b>包</b> 和 <b>模块</b> 以外的 <b>Python Object</b></li>
</ul>


<p>
使用 <b>import</b> 的两种格式：
</p>
<ul class="org-ul">
<li><code>import package/module</code></li>
<li><code>from package/module import object</code></li>
</ul>

<p>
单独使用 <code>import</code> 的时候， 导入的只能是 <b>包</b> 或 <b>模块</b>.
</p>

<p>
而 <code>from ... import ...</code> 的形式则可以从 <b>包</b> 或 <b>模块</b> 中导入任意对象。
</p>
</div>
</div>

<div id="outline-container-org8f1a67b" class="outline-2">
<h2 id="org8f1a67b"><span class="section-number-2">3</span> 相对导入和绝对导入</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf28021b" class="outline-3">
<h3 id="orgf28021b"><span class="section-number-3">3.1</span> 相对导入</h3>
<div class="outline-text-3" id="text-3-1">
<p>
相对导入的方式只能用在 <b>包</b> 内部， 语法格式为：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> . <span style="font-weight: bold;">import</span> <span style="font-weight: bold;">object</span>
</pre>
</div>

<p>
<code>.</code> 代表当前目录， <code>..</code> 代表父级目录， 之后每多一个点代表目录上升一层。
</p>

<p>
很明显， 相对导入的含义是很明确的， 出现的坑也比较少。
</p>

<p>
需要注意的一点： 代表相对路径的符号 <code>.</code> 只能出现在 <code>from</code> 后面而不能出现在 <code>import</code> 后面， 即：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> . <span style="font-weight: bold;">import</span> utils  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">True</span>
<span style="font-weight: bold;">import</span> .utils  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">False</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org07539da" class="outline-3">
<h3 id="org07539da"><span class="section-number-3">3.2</span> 绝对导入</h3>
<div class="outline-text-3" id="text-3-2">
<p>
绝对导入可以在任何地方使用， 所有非 <b>相对导入</b> 都是绝对导入。
</p>

<p>
绝对导入根据 <code>sys.path</code> 来查找 <b>包</b> 或 <b>模块</b>.
</p>

<p>
<code>sys.path</code> 是一个列表， 通常情况下会包含
</p>
<ol class="org-ol">
<li><b>内建模块</b> 的索引路径</li>
<li><b>第三方库</b> 的保存路径</li>
<li>环境变量 <code>PYTHONPATH</code> 列出的目录</li>
<li>脚本所在目录或当前目录</li>
</ol>

<p>
前三个路径一般不需要怎么管， 容易出现问题的地方是第四个 <b>脚本所在目录或当前目录</b>.
</p>

<p>
首先， 需要清楚的一点是： 这个路径会被添加到 <code>sys.path</code> 最前面， 所以如果该路径下存在
和内建或第三方库同名的模块或包， 使用绝对导入会优先导入那个同名的模块。
</p>

<p>
然后， 问题就是确定添加的这个目录到底是 <b>脚本所在目录</b> 还是 <b>当前目录</b> 了。
</p>

<p>
这个问题通过实践来测试：
</p>
<pre class="example">
pkg/
+--- __init__.py
+--- test.py
</pre>

<p>
<code>test.py</code> 中的内容为：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">-*- coding: utf-8 -*-</span>

<span style="font-weight: bold;">import</span> sys

<span style="font-weight: bold;">print</span>(sys.path[0:1])
</pre>
</div>

<p>
执行结果：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">version</th>
<th scope="col" class="org-left">python -m pkg.test</th>
<th scope="col" class="org-left">python pkg/test.py</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Python2.7</code></td>
<td class="org-left"><code>['']</code></td>
<td class="org-left"><code>['C:\\Users\\Administrator\\Desktop\\pkg']</code></td>
</tr>

<tr>
<td class="org-left"><code>Python3.6</code></td>
<td class="org-left"><code>['']</code></td>
<td class="org-left"><code>['C:\\Users\\Administrator\\Desktop\\pkg']</code></td>
</tr>
</tbody>
</table>

<p>
对于直接执行脚本的情况， 添加的目录都是 <b>脚本所在目录</b>.
</p>

<p>
而使用 <code>Python -m</code> 的时候， 添加的目录都是一个 <b>空字符串</b>.
</p>

<p>
现在可以来测试一下 <b>空字符串</b> 代表的含义：
</p>
<pre class="example">
Desktop/
+--- string/
     +--- __init__.py
+--- pkg/
     +--- __init__.py
     +--- test.py
     +--- string.py
</pre>

<p>
<code>test.py</code> 的内容：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">-*- coding: utf-8 -*-</span>

<span style="font-weight: bold;">import</span> string

<span style="font-weight: bold;">print</span>(string)
</pre>
</div>

<p>
执行结果：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">version</th>
<th scope="col" class="org-left">python -m pkg.test</th>
<th scope="col" class="org-left">python pkg/test.py</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Python2.7</code></td>
<td class="org-left"><code>&lt;module 'pkg.string' from 'pkg\string.py'&gt;</code></td>
<td class="org-left"><code>&lt;module 'string' from 'C:\Users\Administrator\Desktop\pkg\string.pyc'&gt;</code></td>
</tr>

<tr>
<td class="org-left"><code>Python3.6</code></td>
<td class="org-left"><code>&lt;module 'string' from 'C:\\Users\\Administrator\\Desktop\\string\\__init__.py'&gt;</code></td>
<td class="org-left"><code>&lt;module 'string' from 'C:\\Users\\Administrator\\Desktop\\pkg\\string.py'&gt;</code></td>
</tr>
</tbody>
</table>


<p>
可以看到， <code>Python pkg/test.py</code> 的输出结果是一样的， 而 <code>Python -m</code> 的结果有所区别。
</p>

<p>
对于 <code>Python2.7</code> 来说， <b>空字符串</b> 代表的目录仍是脚本所在目录， 而对于 <code>Python3.6</code>, 代表的是当前目录。
</p>

<p>
<b>简单汇总一下：</b>
</p>
<ul class="org-ul">
<li><b>直接执行脚本</b> 时添加的路径是 <b>脚本所在目录</b>.</li>
<li>使用 <code>Python -m</code> 的方式执行脚本时， <code>Python2</code> 添加的是 <b>脚本所在目录</b>, 而 <code>Python3</code> 添加的是
<b>当前目录</b>.</li>
</ul>

<p>
另外， <b>绝对导入</b> 会根据 <b>名称</b> 来进行导入， 而在导入时， 包内模块的 <b>名称</b> 就是 <b>包名.模块名</b>,
因此在包内可以使用下面的方式来进行导入：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> package.module <span style="font-weight: bold;">import</span> obejct
</pre>
</div>

<p>
这也是在相对简单的包结构中 <a href="https://www.python.org/dev/peps/pep-0008/#imports">PEP8</a> 推荐使用的方式， 而复杂的包结构可能会有多层嵌套
的 <b>包</b>, 此时如果还用 <b>绝对导入</b> 就是 <b>包A.包B.包C.模块</b> 的形式了， 此时使用 <b>相对导入</b>
会更加简洁.
</p>

<p>
<b>PS</b>: <code>__init__.py</code> 的 <b>名称</b> 就是 <b>包名</b>.
</p>
</div>
</div>
</div>

<div id="outline-container-org9bda75a" class="outline-2">
<h2 id="org9bda75a"><span class="section-number-2">4</span> 同名的包和模块</h2>
<div class="outline-text-2" id="text-4">
<p>
前面了解到， 当前目录下的 <b>包</b> 和 <b>模块</b> 的导入优先级最高。
</p>

<p>
那么， 要是当前目录下存在名字相同的 <b>包</b> 和 <b>模块</b> 怎么处理呢 ？
</p>

<p>
尝试一下：
</p>
<pre class="example">
pkg/
+--- string/
     +--- __init__.py
+--- __init__.py
+--- test.py
+--- string.py
</pre>

<p>
<code>test.py</code> 的内容：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">-*- coding: utf-8 -*-</span>

<span style="font-weight: bold;">import</span> string

<span style="font-weight: bold;">print</span>(string)
</pre>
</div>

<p>
执行结果：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">version</th>
<th scope="col" class="org-left">Python pkg/test.py</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Python2.7</code></td>
<td class="org-left"><code>&lt;module 'string' from 'C:\Users\Administrator\Desktop\pkg\string\__init__.pyc'&gt;</code></td>
</tr>

<tr>
<td class="org-left"><code>Python3.6</code></td>
<td class="org-left"><code>&lt;module 'string' from 'C:\\Users\\Administrator\\Desktop\\pkg\\string\\__init__.py'&gt;</code></td>
</tr>
</tbody>
</table>

<p>
可以看到， 对应 <code>Python2.7</code> 和 <code>Python3.6</code> 来说， 结果是相同的。
</p>

<p>
即： 同一目录下， 同名的 <b>包</b> 和 <b>模块</b>, <b>包</b> 的导入优先级比 <b>模块</b> 高。
</p>

<p>
可以得出的一个优先级排序为：
</p>
<ul class="org-ul">
<li><b>当前目录或脚本所在目录</b> ==&gt; <b>内建模块</b> ==&gt; <b>第三方库</b></li>
<li><b>包</b> ==&gt; <b>模块</b></li>
</ul>
</div>
</div>

<div id="outline-container-org4b75174" class="outline-2">
<h2 id="org4b75174"><span class="section-number-2">5</span> 执行一次导入后</h2>
<div class="outline-text-2" id="text-5">
<p>
很多时候， 我们对某个模块或模块内的对象会进行不止一次的导入。
</p>

<p>
比如对于模块： <code>base</code>, <code>ma,</code> <code>mb</code> 和 <code>mc</code>.
</p>

<p>
模块 <code>ma</code>, <code>mb</code> 和 <code>mc</code> 都导入了模块 <code>base</code> 中的对象， 此时， 这三个模块中导入的对象是什么情况呢 ？
</p>

<p>
这个我进行了一次尝试， 详细的过程就不列出来了， 这里简单说一下结论：
</p>
<ol class="org-ol">
<li>当模块 <code>base</code> 被导入一次后， 其内部的 <b>对象</b> 在全局中就只存在 <b>唯一</b> 的一个实例</li>
<li>在 <b>第一次</b> 导入之后的导入， 导入的对象都是那个 <b>唯一</b> 的实例</li>
<li>此时， 如果在某一个模块中对实例进行了修改， 那么这个修改会反馈到其他地方</li>
</ol>

<p>
上面的结论对于大多数情况都是适用的， 但是存在一种例外：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> module <span style="font-weight: bold;">import</span> num
</pre>
</div>

<p>
像这样直接从 <b>模块</b> 导入一个 <b>数值</b> 对象， 这个数值对象就会绑定到 <b>导入它</b> 的模块， 并从新
在内存中创建一个实例。
</p>

<p>
此时对于这个 <b>数值</b> 的修改不会影响到其他地方。
</p>

<p>
但是， 对于其他的 <b>引用</b> 对象以及像 <code>module.num</code> 这样进行的修改会影响到其他地方。
</p>
</div>
</div>

<div id="outline-container-org6d0bd17" class="outline-2">
<h2 id="org6d0bd17"><span class="section-number-2">6</span> 其他使用细节</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><code>import</code> 会生成 <code>.pyc</code> 文件, <code>.pyc</code> 文件的执行速度不比 <code>.py</code> 快， 但是加载速度更快</li>
<li>重复 <code>import</code> 只会执行第一次 <code>import</code></li>
<li>如果在 <b>执行过程中</b> 中 <code>import</code> 的模块发生改动，可以通过 <code>reload</code> 函数重新加载</li>
<li><code>from xxx import *</code> 会导入除了以 <code>_</code> 开头的所有变量，但是如果定义了 <code>__all__</code>, 那么会导入 <code>__all__</code> 中列出的东西</li>
<li><code>import xxx.object</code> 的方式不能直接使用 <code>object</code>, 仍然需要通过 <code>xxx.object</code> 的方式使用</li>
<li><code>import xxx.object as obj</code> 的方式可以直接使用 <code>obj</code></li>
<li><code>Python3.4</code> 之后的版本中， 内置函数 <code>reload</code> 被移除了， 要使用可以通过 <code>from importlib import reload</code> 导入</li>
<li><p>
还可以这样导入：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> click <span style="font-weight: bold;">import</span> (
    argument,
    command,
    echo,
    edit,
    group,
    Group,
    option,
    pass_context,
    Option,
    version_option,
    BadParameter,
)
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org0ca95e1" class="outline-2">
<h2 id="org0ca95e1"><span class="section-number-2">7</span> 参考链接</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://loggerhead.me/posts/python-de-import-ji-zhi.html">Python 的 import 机制</a></li>
<li><a href="http://codingpy.com/article/python-import-101/">Python导入模块的几种姿势</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
